chipKIT32/chipKIT32-MAX/hardware/pic32/cores/pic32/cpudefs.h
//************************************************************************
//*    cpudefs.h
//*    
//*    Arduino core files for PIC32
//*        Copyright (c) 2011 by Mark Sproul
//*    
//*        This file is designed to provide some of the cpu specific definitions
//*        that are available for avr chips and not for pic32 chips
//************************************************************************
//*    
//*    This library is free software; you can redistribute it and/or
//*    modify it under the terms of the GNU Lesser General Public
//*    License as published by the Free Software Foundation; either
//*    version 2.1 of the License, or (at your option) any later version.
//*    
//*    This library is distributed in the hope that it will be useful,
//*    but WITHOUT ANY WARRANTY; without even the implied warranty of
//*    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.//*    See the GNU
//*    Lesser General Public License for more details.
//*    
//*    You should have received a copy of the GNU Lesser General
//*    Public License along with this library; if not, write to the
//*    Free Software Foundation, Inc., 59 Temple Place, Suite 330,
//*    Boston, MA    02111-1307    USA
//*    
//*    
//************************************************************************
//*    Edit History
//************************************************************************
//*    Apr 16, 2011    <MLS> started on cpudefs.h
//*    Apr 24,    2011    <MLS> copied to bootloader, important to keep them in sync
//*    Jun 16,    2011    <MLS> Added 32MX360F256L
//*    Jun 21,    2011    <MLS> Added 32MX440F512H
//* Nov 19, 2011    <GeneApperson> corrected errors in some parts, added
//*                        definitions for all 1XX/2XX/3XX/4XX/5XX/6XX/7XX devices
//************************************************************************

//************************************************************************
//*    Microchip pic32 chip names
#if defined(__PIC32MX__)

    #define    E2END        0x0fff    //*    4 k of simulated EEPROM
    
    //************************************************************************
    //*    100 series

    #if defined(__32MX110F016B__)
        #define _CPU_NAME_      "32MX110F016B"
        #define FLASHEND        (((16 - 4) * 1024L) - 1)
        #define RAMEND          ((4 * 1024L) - 1)
        #define __PIC32_PINS__  28
        #define __PIC32MX1XX__

    #elif defined(__32MX110F016C__)
        #define _CPU_NAME_      "32MX110F016C"
        #define FLASHEND        (((16 - 4) * 1024L) - 1)
        #define RAMEND          ((4 * 1024L) - 1)
        #define __PIC32_PINS__  36
        #define __PIC32MX1XX__

    #elif defined(__32MX110F016D__)
        #define _CPU_NAME_      "32MX110F016D"
        #define FLASHEND        (((16 - 4) * 1024L) - 1)
        #define RAMEND          ((4 * 1024L) - 1)
        #define __PIC32_PINS__  44
        #define __PIC32MX1XX__

    #elif defined(__32MX120F032B__)
        #define _CPU_NAME_      "32MX120F032B"
        #define FLASHEND        (((32 - 4) * 1024L) - 1)
        #define RAMEND          ((8 * 1024L) - 1)
        #define __PIC32_PINS__  28
        #define __PIC32MX1XX__

    #elif defined(__32MX120F032C__)
        #define _CPU_NAME_      "32MX120F032C"
        #define FLASHEND        (((32 - 4) * 1024L) - 1)
        #define RAMEND          ((8 * 1024L) - 1)
        #define __PIC32_PINS__  36
        #define __PIC32MX1XX__

    #elif defined(__32MX120F032D__)
        #define _CPU_NAME_      "32MX120F032D"
        #define FLASHEND        (((32 - 4) * 1024L) - 1)
        #define RAMEND          ((8 * 1024L) - 1)
        #define __PIC32_PINS__  44
        #define __PIC32MX1XX__

    #elif defined(__32MX130F064B__)
        #define _CPU_NAME_      "32MX130F064B"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((16 * 1024L) - 1)
        #define __PIC32_PINS__  28
        #define __PIC32MX1XX__

    #elif defined(__32MX130F064C__)
        #define _CPU_NAME_      "32MX130F064C"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((16 * 1024L) - 1)
        #define __PIC32_PINS__  36
        #define __PIC32MX1XX__

    #elif defined(__32MX130F064D__)
        #define _CPU_NAME_      "32MX130F064D"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((16 * 1024L) - 1)
        #define __PIC32_PINS__  44
        #define __PIC32MX1XX__

    #elif defined(__32MX150F128B__)
        #define _CPU_NAME_      "32MX150F128B"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  28
        #define __PIC32MX1XX__

    #elif defined(__32MX150F128C__)
        #define _CPU_NAME_      "32MX150F128C"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  36
        #define __PIC32MX1XX__

    #elif defined(__32MX150F128D__)
        #define _CPU_NAME_      "32MX150F128D"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  44
        #define __PIC32MX1XX__

    //************************************************************************
    //*    200 series

    #elif defined(__32MX210F016B__)
        #define _CPU_NAME_      "32MX210F016B"
        #define FLASHEND        (((16 - 4) * 1024L) - 1)
        #define RAMEND          ((4 * 1024L) - 1)
        #define __PIC32_PINS__  28
        #define __PIC32MX2XX__

    #elif defined(__32MX210F016C__)
        #define _CPU_NAME_      "32MX210F016C"
        #define FLASHEND        (((16 - 4) * 1024L) - 1)
        #define RAMEND          ((4 * 1024L) - 1)
        #define __PIC32_PINS__  36
        #define __PIC32MX2XX__

    #elif defined(__32MX210F016D__)
        #define _CPU_NAME_      "32MX210F016D"
        #define FLASHEND        (((16 - 4) * 1024L) - 1)
        #define RAMEND          ((4 * 1024L) - 1)
        #define __PIC32_PINS__  44
        #define __PIC32MX2XX__

    #elif defined(__32MX220F032B__)
        #define _CPU_NAME_      "32MX220F032B"
        #define FLASHEND        (((32 - 4) * 1024L) - 1)
        #define RAMEND          ((8 * 1024L) - 1)
        #define __PIC32_PINS__  28
        #define __PIC32MX2XX__

