chipKIT32/chipKIT32-MAX/hardware/pic32/cores/pic32/cpudefs.h
    #elif defined(__32MX564F128H__)
        #define _CPU_NAME_      "32MX564F128H"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX5XX__

    #elif defined(__32MX575F256H__)
        #define _CPU_NAME_      "32MX575F256H"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX5XX__

    #elif defined(__32MX575F512H__)
        #define _CPU_NAME_      "32MX575F512H"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX5XX__

    #elif defined(__32MX534F064L__)
        #define _CPU_NAME_      "32MX534F064L"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((16 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX5XX__

    #elif defined(__32MX564F064L__)
        #define _CPU_NAME_      "32MX564F064L"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX5XX__

    #elif defined(__32MX564F128L__)
        #define _CPU_NAME_      "32MX564F128L"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX5XX__

    #elif defined(__32MX575F256L__)
        #define _CPU_NAME_      "32MX575F256L"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX5XX__

    #elif defined(__32MX575F512L__)
        #define _CPU_NAME_      "32MX575F512L"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX5XX__

    //************************************************************************
    //*    600 series

    #elif defined(__32MX664F064H__)
        #define _CPU_NAME_      "32MX664F064H"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX6XX__

    #elif defined(__32MX664F128H__)
        #define _CPU_NAME_      "32MX664F128H"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX6XX__

    #elif defined(__32MX675F256H__)
        #define _CPU_NAME_      "32MX675F256H"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX6XX__

    #elif defined(__32MX675F512H__)
        #define _CPU_NAME_      "32MX675F512H"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX6XX__

    #elif defined(__32MX695F512H__)
        #define _CPU_NAME_      "32MX695F512H"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__ 64
        #define __PIC32MX6XX__

    #elif defined(__32MX664F064L__)
        #define _CPU_NAME_      "32MX664F064L"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX6XX__

    #elif defined(__32MX664F128L__)
        #define _CPU_NAME_      "32MX664F128L"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX6XX__

    #elif defined(__32MX675F256L__)
        #define _CPU_NAME_      "32MX675F256L"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX6XX__

    #elif defined(__32MX675F512L__)
        #define _CPU_NAME_      "32MX675F512L"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX6XX__

    #elif defined(__32MX695F512L__)
        #define _CPU_NAME_      "32MX695F512L"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX6XX__

    //************************************************************************
    //*    700 series

    #elif defined(__32MX764F128H__)
        #define _CPU_NAME_      "32MX764F128H"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX7XX__

    #elif defined(__32MX775F256H__)
        #define _CPU_NAME_      "32MX775F256H"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX7XX__

    #elif defined(__32MX775F512H__)
        #define _CPU_NAME_      "32MX775F512H"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX7XX__

    #elif defined(__32MX795F512H__)
        #define _CPU_NAME_      "32MX795F512H"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX7XX__

    #elif defined(__32MX764F128L__)
        #define _CPU_NAME_      "32MX764F128L"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX7XX__

    #elif defined(__32MX775F256L__)
        #define _CPU_NAME_      "32MX775F256L"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX7XX__

    #elif defined(__32MX775F512L__)
        #define _CPU_NAME_      "32MX775F512L"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX7XX__

