chipKIT32/chipKIT32-MAX/hardware/pic32/cores/pic32/cpudefs.h
    #elif defined(__32MX795F512L__)
        #define _CPU_NAME_      "32MX795F512L"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX7XX__


    //************************************************************************
    #else
        #error CPU type is unknown, cpudefs.h needs to have additions
    #endif

#elif defined(__PIC32MZ__)

    #if defined(__32MZ1024ECG064__)
        #define _CPU_NAME_      "32MZ1024ECG064"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECH064__)
        #define _CPU_NAME_      "32MZ1024ECH064"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECM064__)
        #define _CPU_NAME_      "32MZ1024ECM064"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__

    #elif defined(__32MZ2048ECG064__)
        #define _CPU_NAME_      "32MZ2048ECG064"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__

    #elif defined(__32MZ2048ECH064__)
        #define _CPU_NAME_      "32MZ2048ECH064"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__

    #elif defined(__32MZ2048ECM064__)
        #define _CPU_NAME_      "32MZ2048ECM064"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECG100__)
        #define _CPU_NAME_      "32MZ1024ECG100"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__
 
    #elif defined(__32MZ1024ECH100__)
        #define _CPU_NAME_      "32MZ1024ECH100"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECM100__)
        #define _CPU_NAME_      "32MZ1024ECM100"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__
 
    #elif defined(__32MZ2048ECG100__)
        #define _CPU_NAME_      "32MZ2048ECG100"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__

    #elif defined(__32MZ2048ECH100__)
        #define _CPU_NAME_      "32MZ2048ECH100"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__

    #elif defined(__32MZ2048ECM100__)
        #define _CPU_NAME_      "32MZ2048ECM100"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECG124__)
        #define _CPU_NAME_      "32MZ1024ECG124"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  124
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECH124__)
        #define _CPU_NAME_      "32MZ1024ECH124"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  124
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECM124__)
        #define _CPU_NAME_      "32MZ1024ECM124"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  124
        #define __PIC32MZXX__

    #elif defined(__32MZ2048ECG124__)
        #define _CPU_NAME_      "32MZ2048ECG124"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  124
        #define __PIC32MZXX__

    #elif defined(__32MZ2048ECH124__)
        #define _CPU_NAME_      "32MZ2048ECH124"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  124
        #define __PIC32MZXX__

    #elif defined(__32MZ2048ECM124__)
        #define _CPU_NAME_      "32MZ2048EC124"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  124
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECG144__)
        #define _CPU_NAME_      "32MZ1024ECG144"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  144
        #define __PIC32MZXX__
 
    #elif defined(__32MZ1024ECH144__)
        #define _CPU_NAME_      "32MZ1024ECH144"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  144
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECM144__)
        #define _CPU_NAME_      "32MZ1024ECM144"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  144
        #define __PIC32MZXX__
 
    #elif defined(__32MZ2048ECG144__)
        #define _CPU_NAME_      "32MZ2048ECG144"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  144
        #define __PIC32MZXX__

    #elif defined(__32MZ2048ECH144__)
        #define _CPU_NAME_      "32MZ2048ECH144"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  144
        #define __PIC32MZXX__

    #elif defined(__32MZ2048ECM144__)
        #define _CPU_NAME_      "32MZ2048ECM144"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  144
        #define __PIC32MZXX__
 
    #elif defined(__32MZ0512ECE064__)
        #define _CPU_NAME_      "32MZ0512ECE064"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__
 
    #elif defined(__32MZ0512ECF064__)
        #define _CPU_NAME_      "32MZ0512ECF064"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__

    #elif defined(__32MZ0512ECK064__)
        #define _CPU_NAME_      "32MZ0512ECK064"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__
 
