chipKIT32/chipKIT32-MAX/hardware/pic32/cores/pic32/cpudefs.h
    #elif defined(__32MZ1024ECE064__)
        #define _CPU_NAME_      "32MZ1024ECE064"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECF064__)
        #define _CPU_NAME_      "32MZ1024ECF064"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECK064__)
        #define _CPU_NAME_      "32MZ1024ECK064"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__
 
    #elif defined(__32MZ0512ECE100__)
        #define _CPU_NAME_      "32MZ0512ECE100"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__

    #elif defined(__32MZ0512ECF100__)
        #define _CPU_NAME_      "32MZ0512ECF100"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__

    #elif defined(__32MZ0512ECK100__)
        #define _CPU_NAME_      "32MZ0512ECK100"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECE100__)
        #define _CPU_NAME_      "32MZ1024ECE100"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECF100__)
        #define _CPU_NAME_      "32MZ1024ECF100"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECK100__)
        #define _CPU_NAME_      "32MZ1024ECK100"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__
 
    #elif defined(__32MZ0512ECE124__)
        #define _CPU_NAME_      "32MZ0512ECE124"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  124
        #define __PIC32MZXX__

    #elif defined(__32MZ0512ECF124__)
        #define _CPU_NAME_      "32MZ0512ECF124"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  124
        #define __PIC32MZXX__
 
    #elif defined(__32MZ0512ECK124__)
        #define _CPU_NAME_      "32MZ0512ECK124"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  124
        #define __PIC32MZXX__
 
    #elif defined(__32MZ1024ECE124__)
        #define _CPU_NAME_      "32MZ1024ECE124"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PINS__  124
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECF124__)
        #define _CPU_NAME_      "32MZ1024ECF124"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PINS__  124
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECK124__)
        #define _CPU_NAME_      "32MZ1024ECK124"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PINS__  124
        #define __PIC32MZXX__

    #elif defined(__32MZ0512ECE144__)
        #define _CPU_NAME_      "32MZ0512ECE144"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  144
        #define __PIC32MZXX__

     #elif defined(__32MZ0512ECF144__)
        #define _CPU_NAME_      "32MZ0512ECF144"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  144
        #define __PIC32MZXX__
 
    #elif defined(__32MZ0512ECK144__)
        #define _CPU_NAME_      "32MZ0512ECK144"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  144
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECE144__)
        #define _CPU_NAME_      "32MZ1024ECE144"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PINS__  144
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECF144__)
        #define _CPU_NAME_      "32MZ1024ECF144"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PINS__  144
        #define __PIC32MZXX__

    #elif defined(__32MZ1024ECK144__)
        #define _CPU_NAME_      "32MZ1024ECK144"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PINS__  144
        #define __PIC32MZXX__

    #elif defined(__32MZ2048EFG064__)
        #define _CPU_NAME_      "32MZ2048EFG064"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ2048EFG100__)
        #define _CPU_NAME_      "32MZ2048EFG100"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ2048EFG124__)
        #define _CPU_NAME_      "32MZ2048EFG124"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  124
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ2048EFG144__)
        #define _CPU_NAME_      "32MZ2048EFG144"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  144
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ2048EFH064__)
        #define _CPU_NAME_      "32MZ2048EFH064"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ2048EFH100__)
        #define _CPU_NAME_      "32MZ2048EFH100"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ2048EFH124__)
        #define _CPU_NAME_      "32MZ2048EFH124"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  124
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ2048EFH144__)
        #define _CPU_NAME_      "32MZ2048EFH144"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  144
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

