chipKIT32/chipKIT32-MAX/hardware/pic32/cores/pic32/cpudefs.h
    #elif defined(__32MZ2048EFM064__)
        #define _CPU_NAME_      "32MZ2048EFM064"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ2048EFM100__)
        #define _CPU_NAME_      "32MZ2048EFM100"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ2048EFM124__)
        #define _CPU_NAME_      "32MZ2048EFM124"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  124
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ2048EFM144__)
        #define _CPU_NAME_      "32MZ2048EFM144"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PINS__  144
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #else
        #error CPU type is unknown, cpudefs.h needs to have additions
    #endif

// do we have EF or EC ADCs
#ifndef __PIC32MZEFADC__
#define __PIC32MZECADC__
#endif

#else
    #error unknown cpu architecture
#endif

//************************************************************************
#ifndef _CPU_NAME_
    #define _CPU_NAME_    "Unknown"
#endif
